import React, { Component } from 'react'
import { Link } from "react-router-dom";

export default class ZaslonIns extends Component {


    render() {
        return (
            <div>
                <p><span>Время прохождения не ограничено</span></p>
                <p>Опросник самовосприятия предназначен для оценки соответствия участников исполняемым ими командным ролям.  На каждый блок утверждений Вам дается 10 баллов. Распределите их по нескольким утверждениям в рамках каждого блока. В исключительных случаях баллы можно распределить между всеми утверждениями или все десять баллов поставить напротив одного утверждения.
                </p>
                <Link to='./vos'><button>Начать тест</button></Link>
            </div>
        )
    }
}
