import React from 'react'

class Instructions {

    static zaslonIns() {
        return (
            <div>
                <p><span>Ограничение по времени: 15 минут</span></p>
                <p>Выберите один наиболее подходящий для вас вариант ответа в каждом приведенном утверждении.
                </p>
            </div>
        )
    }

    static luscjerIns() {
        return (
            <div>
                <p><span>Время прохождения не ограничено</span></p>
                <p>Во время прохождения теста Вам необходимо выбрать из предложенных восьми цветов тот, который больше всего нравится. Вы должны выбрать цвет как таковой, не пытаясь соотнести его с любимым цветом в одежде, цветом глаз и т. п. Выберите наиболее приятный цвет из восьми и нажмите на него. После нажатия прямоугольник сменит цвет на белый. Повторяйте эту процедуру до тех пор, пока все прямоугольники не перекрасятся в белый. Затем повторите прохождение для второго набора карточек, который появится после работы с первым
                </p>
            </div>
        )
    }

    static bigIns() {
        return (
            <div>
                <p><span>Время прохождения не ограничено</span></p>
                <p>Оцените каждое утверждение по шкале от 1 до 7, где 1 - полностью не согласен, 7 - полностью согласен.</p>
            </div>
        )
    }

    static vosIns() {
        return (
            <div>
                <p><span>Время прохождения не ограничено</span></p>
                <p>Распределите 10 баллов в каждом блоке утверждений, которые, по вашему мнению, лучше всего описывают ваше поведение. Баллы необходимо распределить по нескольким утверждениям. В исключительных случая баллы можно распределить между всеми утверждениями  или все десять баллов поставить напротив одного утверждения. Внесите баллы в таблицу. </p>
            </div>
        )

    }

    static omoIns() {
        return (
            <div>
                <p><span>Время прохождения не ограничено</span></p>
                <p>Опросник межличностных ориентаций предназначен для оценки типичных способов Вашего взаимодействия с коллегами. Некоторые вопросы очень похожи друг на друга. Но все-таки они подразумевают разные вещи. Отвечайте, пожалуйста, на каждый вопрос отдельно, без оглядки на другие вопросы. </p>
            </div>
        )
    }

    static kompIns() {
        return (
            <div>
                <p><span>Время прохождения не ограничено</span></p>
                <p>Для каждого вопросы выберите один или несколько подходящих для Вас вариантов ответов.</p>
            </div>
        )
    }

    static ankIns() {
        return (
            <div>
                Пожалуйста, заполните представленные в данной анкете поля. Если у Вас отсутствуют необходимые для заполнения данные, например Вы не зарегистрированы в системе Orcid, оставьте соответствующее поле пустым.
            </div>
        )
    }

    static interIns() {
        return (
            <div>
                Для корректной работы сервиса необходимо придерживаться следующих условий:
                <ol>
                    <li>необходимо качественное освещение;</li>
                    <li>отсутсвие источников света в кадре;</li>
                    <li>испытуемый должен находиться перпендикулярно камере, желательно чтобы камера находилась на
                        уровне глаз</li>
                    <li>В кадр должно полностью попадать лицо испытуемого</li>
                </ol>

                После нажатия кнопки <span>"Начать интервью"</span> появится окно, которое будет транслировать
                видеозапись с Вашей камеры. Чуть ниже
                будет отражаться текущий ворос, Вам необходимо на него полностью ответить. Важно чтобы длина ответа на
                каждый вопрос
                была более 30 секунд. После ответа на вопрос необходимо нажать на кнопку <span>"следующий
                    вопрос"</span>, после чего появится новый
                вопрос. Всего вопросов будет несколько, около 10-15 штук. После ответа на все вопросы появится кнопка
                <span>"Завершить интервью"</span> по нажатию которой видеозапись ответа завершится.
            </div>
        )
    }
}

export default Instructions;